## Cleaning Columns

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({
'First Name':['Sahil','Sonia','Sourav','Vishal'],
'Age^':[10,20,30,40],
'Ge%nder%':['M','F','M','M'],
'City':['J','K','L','P'],
'Place of      Work':[True,False,False,True],
 'Place-of-Work':[True,False,False,True]
}
)
df

  First Name  Age^ Ge%nder% City  Place of      Work  Place-of-Work
0      Sahil    10        M    J                True           True
1      Sonia    20        F    K               False          False
2     Sourav    30        M    L               False          False
3     Vishal    40        M    P                True           True

### Remove spaces from names

In [3]:
df2=df.copy(deep=True)

In [4]:
df2.columns=df2.columns.str.replace(' +','_')

c:\users\sahil choudhary\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  """Entry point for launching an IPython kernel.

In [5]:
df2

  First_Name  Age^ Ge%nder% City  Place_of_Work  Place-of-Work
0      Sahil    10        M    J           True           True
1      Sonia    20        F    K          False          False
2     Sourav    30        M    L          False          False
3     Vishal    40        M    P           True           True

### Remove Special Characters from Names

In [6]:
df2=df.copy(deep=True)

In [7]:
df2

  First Name  Age^ Ge%nder% City  Place of      Work  Place-of-Work
0      Sahil    10        M    J                True           True
1      Sonia    20        F    K               False          False
2     Sourav    30        M    L               False          False
3     Vishal    40        M    P                True           True

In [8]:

# df2.columns = df2.columns.str.replace(' +', '_') # + means n numbers

# Rename specific columns explicitly if needed
df2.rename({'Ge%nder%':'Gender'},axis=1,inplace=True)

# If you want to do this step only if column of this name exists,then wrap it in if condition:
if 'Ge%nder%' in df2.columns:
    df2.rename({'Ge%nder%':'Gender'},axis=1,inplace=True)

In [9]:
df2

  First Name  Age^ Gender City  Place of      Work  Place-of-Work
0      Sahil    10      M    J                True           True
1      Sonia    20      F    K               False          False
2     Sourav    30      M    L               False          False
3     Vishal    40      M    P                True           True

In [10]:
df2.columns=df2.columns.str.replace('[^A-Za-z]+', '_')

c:\users\sahil choudhary\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  """Entry point for launching an IPython kernel.

In [11]:
df2

  First_Name  Age_ Gender City  Place_of_Work  Place_of_Work
0      Sahil    10      M    J           True           True
1      Sonia    20      F    K          False          False
2     Sourav    30      M    L          False          False
3     Vishal    40      M    P           True           True

In [12]:
df2.columns = df2.columns.str.strip('_')    # used to remve specific characters from first and last position

In [13]:
df2

  First_Name  Age Gender City  Place_of_Work  Place_of_Work
0      Sahil   10      M    J           True           True
1      Sonia   20      F    K          False          False
2     Sourav   30      M    L          False          False
3     Vishal   40      M    P           True           True

#### Patterns

- [^A-Za-z]+ - If you just want to ignore A-Z or a-z alphabets
- [^A-Za-z\s]+ - If you just want to ignore A-Z or a-z alphabets and spaces
- [^A-Za-z0-9]+ If you wantto ignore alphabets + numbers

#### Note

- All the string functions (like replace) can be chained aswell
    - df['col'].str.replace('%','_').str.replace('$','_')